package ch09.sec01;

public class Nested_Class {
    // 중첩 클래스 (Nested_Class): 클래스 내부에 선언한 클래스
    // 중첩 클래스 사용하면 클래스의 멤버를 쉽게 사용할 수 있고 외부에는 중첩관계 클래스를 감춤으로써 코드의 복잡성을 줄일 수 있다.
    // 인스턴스 멤버 클래스: 클래스의 멤버로서 선언되는 중첩 클래스 , 바깥클래스의 객체를 생성해야만 인스턴스 멤버 클래스 객체를 생성 할 수
    // 있음
    // 정적 멤버 클래스 : 클래스의 멤버로서 선언되는 중첩 클래스, 바깥클래스의 객체를 생성하지 않아도 정적멤버클래스의 객체를 생성 할 수 있음
    // 로컬 클래스: 생성자 or 메소드 내부에 선언되는 중첩 클래스, 생성자와 메소드가 실행될 동안에만 객체 생성 할 수 있음
    // 로컬변수 ( 생성자 or 메소드의 매개변수 or 내부에서 선언된 변수)를 로컬 클래스에 사용 할 경우, 로컬변수는 final 특성을
    // 가지므로 값을 읽을 수만 있고, 수정 불가

}
